lab11_ci/ci4/app/Controllers/api/Auth.php

    public function login()
    {
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');

        $model = new UserModel();

        // Cari berdasarkan username ATAU email
        $user = $model->where('username', $username)
                      ->orWhere('useremail', $username)
                      ->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin@email.com'
OR `useremail` = 'admin@email.com'
 LIMIT 1